/*## Задача - Christmas Tree

Основна вимоги(Закриється одна практична -> 2.3 або 2.4)
Напишіть програму, яка отримує від користувача число n, що вказує кількість рівнів(шарів) ялинки.Програма повинна вивести ялинку з n рівнів у вигляді трикутників з зірочок(*).Кожен рівень ялинки складається з кількох рядків, де кількість зірочок збільшується від 1 до непарного числа, а також відображається стовбур.

Додаткові вимоги(Закриваються дві практичні -> 2.3 i 2.4)
+ за використання двохвимірного масиву
+ за відмальовування ялинки в кольорі
+ за додавання в рандомних місцях ялинки іграшок(@, $, %, #)
+ за запис ялинки в файл - cristmas_tree.txt

Advanced(2.2 i 2.3 i 2.4)
+ Зробити гірляду, в якій іграшки будуть вмикатись і вимикатись*/

#include <iostream>
using namespace std;

int main() {
	int a;//
	int b;//
	cin >> a;
	cin >> b;
	char star = "*";
	

		for (int i = 0; i <= 3, i++) {
			for (int j = 0; j <= 5, j++) {
				cout << "i\n ";
				cout << "j   ";

			}
			
	}
}

